HELP_1 ="""<b><u>أوامر المسؤول :</b></u>

فقط أضف <b> c </b> في بداية الأوامر لاستخدامها في القناة.


/pause: إيقاف تشغيل التيار الحالي.

/resume: استئناف التيار الذي تم إيقافه.

/skip: تخطي التيار الحالي وبدء تيار التالي في الصف.

/end أو /stop: مسح الصف وإنهاء التيار الحالي.

/player: الحصول على لوحة تحكم تفاعلية.

/queue: عرض قائمة التيارات المنتظرة.
"""

HELP_2 = """
<b><u>مستخدمون مصرح لهم:</b></u>

يمكن للمستخدمين المصرح لهم استخدام أوامر المسؤول في البوت دون وجود صلاحيات المسؤول في المحادثة.

/auth [اسم المستخدم / معرف المستخدم]: إضافة مستخدم إلى قائمة المصرح بهم في البوت.
/unauth [اسم المستخدم / معرف المستخدم]: إزالة مستخدم مصرح به من قائمة المصرح بهم.
/authusers: عرض قائمة المستخدمين المصرح بهم في المجموعة.
"""

HELP_3 = """
<u><b>ميزة البث</b></u> [فقط للمشرفين]:

/broadcast [رسالة أو الرد على رسالة]: بث رسالة إلى محادثات الخادم.

<u>أوضاع البث:</u>
<b>-pin</b>: تثبيت رسائل البث في محادثات الخادم.
<b>-pinloud</b>: تثبيت رسائل البث في محادثات الخادم وإرسال إشعار إلى الأعضاء.
<b>-user</b>: بث الرسالة للمستخدمين الذين بدأوا استخدام البوت.
<b>-assistant</b>: بث رسالتك من حساب المساعد الخاص بالبوت.
<b>-nobot</b>: يجبر البوت على عدم بث الرسالة.

<b>مثال:</b> <code> /broadcast -user -assistant -pin اختبار البث </code>
"""

HELP_4 = """<u><b>ميزة قائمة الحظر في المحادثات:</b></u> [فقط للمشرفين]

قيد المحادثات السيئة لاستخدام بوتنا الثمين.

/blacklistchat [معرف المحادثة]: إضافة محادثة إلى قائمة الحظر من استخدام البوت.
/whitelistchat [معرف المحادثة]: إزالة الحظر عن محادثة مضافة إلى قائمة الحظر.
/blacklistedchat: عرض قائمة المحادثات المحظورة.
"""

HELP_5 = """
<u><b>حظر المستخدمين:</b></u> [فقط للمشرفين]

يبدأ تجاهل المستخدمين المحظورين حتى يتمكنوا من استخدام أوامر البوت.

/block [اسم المستخدم أو الرد على المستخدم]: حظر المستخدم من استخدام بوتنا.
/unblock [اسم المستخدم أو الرد على المستخدم]: إلغاء حظر المستخدم المحظور.
/blockedusers: عرض قائمة المستخدمين المحظورين.
"""

HELP_6 = """
<u><b>أوامر تشغيل القناة:</b></u>

يمكنك بث الصوت / الفيديو في القناة.

/cplay: يبدأ بث المسار الصوتي المطلوب في محادثة الفيديو الخاصة بالقناة.
/cvplay: يبدأ بث المسار الفيديو المطلوب في محادثة الفيديو الخاصة بالقناة.
/cplayforce أو /cvplayforce: يوقف التيار الحالي ويبدأ بث المسار المطلوب.

/channelplay [اسم المستخدم أو المعرف] أو [تعطيل]: يوصل القناة بمجموعة ويبدأ بث المسارات بواسطة الأوامر المرسلة في المجموعة.
"""

HELP_7 = """
<u><b>ميزة الحظر العالمي:</b></u> [فقط للمشرفين]:

/gban [اسم المستخدم أو الرد على المستخدم]: يحظر الشخص من جميع المحادثات الخاصة بالبوت ويضيفه إلى قائمة الحظر.
/ungban [اسم المستخدم أو الرد على المستخدم]: يلغي الحظر العالمي للشخص.
/gbannedusers: يعرض قائمة المستخدمين المحظورين عالمياً.
"""

HELP_8 = """
<b><u>تكرار التشغيل المستمر:</b></u>

<b>يبدأ بث التيار الصوتي المستمر</b>

/loop [enable/disable]: يفعل/يعطل التكرار للتيار الحالي.
/loop [1، 2، 3، ...]: يفعل التكرار للقيمة المحددة.
"""

HELP_9 = """
<u><b>وضع الصيانة:</b></u> [فقط للمشرفين]:

/logs: يحصل على سجلات البوت.

/logger [enable/disable]: يبدأ/يتوقف البوت عن تسجيل الأنشطة.
/maintenance [enable/disable]: يقوم بتفعيل/تعطيل وضع الصيانة للبوت.
"""

HELP_10 = """
<b><u>الاستجابة والإحصائيات:</b></u>

/start : يبدأ بوت الموسيقى.
/help : يحصل على قائمة المساعدة مع شرح للأوامر.

/ping : يظهر الاستجابة وإحصائيات النظام للبوت.

/stats : يظهر الإحصائيات العامة للبوت.
"""

HELP_11 = """
<u><b>أوامر التشغيل:</b></u>

<b>v :</b> يرمز لتشغيل الفيديو.
<b>force :</b> يرمز للتشغيل القسري.

/play أو /vplay : يبدأ بث الأغنية المطلوبة في محادثة الفيديو.

/playforce أو /vplayforce : يتوقف عن التشغيل الحالي ويبدأ بث الأغنية المطلوبة.
"""

HELP_12 = """
<b><u>ترتيب عشوائي للقائمة:</b></u>

/shuffle : يقوم بترتيب عشوائي للقائمة.
/queue : يعرض القائمة المرتبة عشوائياً.
"""

HELP_13 = """
<b><u>تحديد موقع التشغيل:</b></u>

/seek [المدة بالثواني] : يقوم بتحديد موقع التشغيل إلى المدة المعطاة.
/seekback [المدة بالثواني] : يقوم بالتراجع إلى الوراء للمدة المعطاة.
"""

HELP_14 = """
<b><u>تحميل الأغنية:</b></u>

/song [اسم الأغنية/رابط YouTube] : يقوم بتحميل أي مسار من يوتيوب بتنسيق MP3 أو MP4.
"""

HELP_15 = """
<b><u>أوامر السرعة:</b></u>

يمكنك التحكم في سرعة التشغيل للبث الحالي. [للمسؤولين فقط]

/speed or /playback : لضبط سرعة التشغيل الصوتي في المجموعة.
/cspeed or /cplayback : لضبط سرعة التشغيل الصوتي في القناة.
"""
